Tekla.Structures.DialogInternal.AttributeManager
Represents a collection of attributes that can be bound with Form controls.

Tekla.Structures.DialogInternal.AttributeManager.Item(System.String)
Gets the attribute with the specified name.
Name: The name of the attribute to get.
Returns:
The attribute with the specified name.
If the specified name is not found a KeyNotFoundException is thrown.
Throws System.ArgumentNullException: Name is null
Throws System.Collections.Generic.KeyNotFoundException: No attribute exists with the specified name.

Tekla.Structures.DialogInternal.AttributeManager.Attributes
Gets the attributes of the AttributeManager.

Tekla.Structures.DialogInternal.AttributeManager.AddAttribute(System.String,System.Type,System.Boolean)
Add a new attribute and optionally create filter for it.
An exception is thrown if attribute with identical name and different type exists.
This method is safe to call multiple times with same attribute name and type.
The subsequent method calls are no-op unless there is a need to create a filter for
existing attribute.
Name: The name of the attribute.
ReturnType: The type of the attribute.
CreateFilter: Create filter for the attribute.
Throws System.InvalidOperationException: Attribute exists with different type.

Tekla.Structures.DialogInternal.AttributeManager.AddAttribute(System.String,System.Type)
Add a new attribute.
An exception is thrown if attribute with identical name and different type exists.
This method is safe to call multiple times with same attribute name and type.
The subsequent method calls are no-op.
Name: The name of the attribute.
ReturnType: The type of the attribute.
Throws System.InvalidOperationException: Attribute exists with different type.

Tekla.Structures.DialogInternal.AttributeManager.ContainsAttribute(System.String)
Determines whether the AttributeManager contains the specified attribute.
Name: The name of the attribute.
Returns: true if AttributeManager contains attribute with specified name; otherwise, false.

Tekla.Structures.DialogInternal.AttributeManager.RemoveAttribute(System.String)
Removes the attribute with the specified name.
Name: The name of the attribute.

Tekla.Structures.DialogInternal.AttributeManager.TryGetAttribute(System.String,Tekla.Structures.DialogInternal.AttributeInfo@)
Gets the attribute with the specified name.
Name: The name of the attribute to get.
Attribute:
When this method returns, contains the attribute with the specified name,
if it exists; otherwise, null. This parameter is passed uninitialized.
Returns:
true if the AttributeManager contains the attribute with the specified name;
otherwise, false.

Tekla.Structures.DialogInternal.AttributeManager.UnbindControl(System.Windows.Forms.Control)
Removes all attribute bindings to the specified control.
Ctrl: The control that is unbound.

Tekla.Structures.DialogInternal.AttributeManager.UnbindAllControls
Removes all attribute bindings that have been made.

Tekla.Structures.DialogInternal.AttributeManager.LoadXml(System.IO.Stream)
Loads the attribute values from the stream.
FileStream: The stream to read.

Tekla.Structures.DialogInternal.AttributeManager.SaveXml(System.IO.Stream)
Saves the attribute values to the stream.
FileStream: The stream to write.

Tekla.Structures.DialogInternal.AttributeManager.OnAttributeRemoved(Tekla.Structures.DialogInternal.AttributeRemovedEventArgs)
Raises the Tekla.Structures.DialogInternal.AttributeManager.AttributeRemoved event.
EventArgs: An Tekla.Structures.DialogInternal.AttributeRemovedEventArgs that contains the event data.